In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [5]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [6]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [7]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [8]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [9]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [10]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [11]:
ser['Hud']

4

In [12]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [15]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [16]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
type(df['W'])

pandas.core.series.Series

In [20]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -0.460663  0.799778  2.299812  1.670287  1.839148
B  0.206169  1.148007 -0.626479  1.743736 -0.420310
C  1.335829  0.724270 -0.403767  0.489680  0.932062
D -0.770633 -0.050952 -0.529794 -0.815990 -1.300427
E  0.364894 -0.212529 -1.160266 -0.603320 -0.795373

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [22]:
df

          W         X         Y         Z       new
A -0.460663  0.799778  2.299812  1.670287  1.839148
B  0.206169  1.148007 -0.626479  1.743736 -0.420310
C  1.335829  0.724270 -0.403767  0.489680  0.932062
D -0.770633 -0.050952 -0.529794 -0.815990 -1.300427
E  0.364894 -0.212529 -1.160266 -0.603320 -0.795373

In [23]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [25]:
df.drop('C',axis=0)

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [26]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [27]:
# df.loc?

In [28]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [29]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [30]:
df.loc['A']

W   -0.460663
X    0.799778
Y    2.299812
Z    1.670287
Name: A, dtype: float64

In [31]:
df.loc['B','Y']

-0.6264794401040175

In [32]:
df.loc[['A','B'],['W']]

          W
A -0.460663
B  0.206169

In [33]:
df.loc['A':'D','W':'Y']

          W         X         Y
A -0.460663  0.799778  2.299812
B  0.206169  1.148007 -0.626479
C  1.335829  0.724270 -0.403767
D -0.770633 -0.050952 -0.529794

In [34]:
df.loc[df.W>0,:]

          W         X         Y         Z
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
E  0.364894 -0.212529 -1.160266 -0.603320

In [35]:
df.loc[:,'Y']

A    2.299812
B   -0.626479
C   -0.403767
D   -0.529794
E   -1.160266
Name: Y, dtype: float64

In [36]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [37]:
df.iloc[2]

W    1.335829
X    0.724270
Y   -0.403767
Z    0.489680
Name: C, dtype: float64

In [38]:
df.iloc[[2,4],1]

C    0.724270
E   -0.212529
Name: X, dtype: float64

In [39]:
list(df.W >0)

[False, True, True, False, True]

In [40]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
E  0.364894 -0.212529 -1.160266 -0.603320

In [41]:
df>0

       W      X      Y      Z
A  False   True   True   True
B   True   True  False   True
C   True   True  False   True
D  False  False  False  False
E   True  False  False  False

In [42]:
df[df>0]

          W         X         Y         Z
A       NaN  0.799778  2.299812  1.670287
B  0.206169  1.148007       NaN  1.743736
C  1.335829  0.724270       NaN  0.489680
D       NaN       NaN       NaN       NaN
E  0.364894       NaN       NaN       NaN

In [43]:
df[df['W']>0]

          W         X         Y         Z
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
E  0.364894 -0.212529 -1.160266 -0.603320

In [44]:
df

          W         X         Y         Z
A -0.460663  0.799778  2.299812  1.670287
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
D -0.770633 -0.050952 -0.529794 -0.815990
E  0.364894 -0.212529 -1.160266 -0.603320

In [45]:
df[df['W']>0]['Y']

B   -0.626479
C   -0.403767
E   -1.160266
Name: Y, dtype: float64

In [46]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.626479  1.148007
C -0.403767  0.724270
E -1.160266 -0.212529

In [47]:
df[(df['W']>0) & (df['Y'] <0)]

          W         X         Y         Z
B  0.206169  1.148007 -0.626479  1.743736
C  1.335829  0.724270 -0.403767  0.489680
E  0.364894 -0.212529 -1.160266 -0.603320

In [48]:
df.reset_index(inplace = True)

In [49]:
df

  index         W         X         Y         Z
0     A -0.460663  0.799778  2.299812  1.670287
1     B  0.206169  1.148007 -0.626479  1.743736
2     C  1.335829  0.724270 -0.403767  0.489680
3     D -0.770633 -0.050952 -0.529794 -0.815990
4     E  0.364894 -0.212529 -1.160266 -0.603320

In [50]:
df.set_index('index',inplace=True)

In [51]:
df

              W         X         Y         Z
index
A     -0.460663  0.799778  2.299812  1.670287
B      0.206169  1.148007 -0.626479  1.743736
C      1.335829  0.724270 -0.403767  0.489680
D     -0.770633 -0.050952 -0.529794 -0.815990
E      0.364894 -0.212529 -1.160266 -0.603320

In [52]:
df = pd.DataFrame({'CE':[1,2,0],
                  'CS':[5,0,2],
                  'EE':[11,20,0],
                  'Pharmacy':[23,15,np.nan]},index=['C++','Math','Electrical'])

In [53]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [54]:
df.dropna()

      CE  CS  EE  Pharmacy
C++    1   5  11      23.0
Math   2   0  20      15.0

In [55]:
df.dropna(axis=1)

            CE  CS  EE
C++          1   5  11
Math         2   0  20
Electrical   0   2   0

In [56]:
df.dropna(thresh=2)

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [57]:
df.fillna(value='FILL VALUE')

            CE  CS  EE    Pharmacy
C++          1   5  11        23.0
Math         2   0  20        15.0
Electrical   0   2   0  FILL VALUE

In [58]:
df['Pharmacy'].fillna(value=df['Pharmacy'].mean(),inplace=True)

In [59]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0      19.0

In [60]:
data = {'Subject':['DBMS','DBMS','MCSC','MCSC','DIFF','DIFF'],
       'Instructor':['Santosh','Nabin','Gokul','Ram','Saraswoti','Khim'],
       'Assignments':[10,2,4,5,6,4]}

In [61]:
df = pd.DataFrame(data)
df

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6
5    DIFF       Khim            4

In [62]:
by_comp = df.groupby('Subject')
by_comp

In [63]:
by_comp.mean()

TypeError: agg function failed [how->mean,dtype->object]

In [64]:
df.head()

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6

In [65]:
df.describe()

       Assignments
count     6.000000
mean      5.166667
std       2.714160
min       2.000000
25%       4.000000
50%       4.500000
75%       5.750000
max      10.000000

In [66]:
df['Subject'].unique()

array(['DBMS', 'MCSC', 'DIFF'], dtype=object)

In [67]:
df['Instructor'].nunique()

6

In [68]:
df['Subject'].value_counts()

Subject
DBMS    2
MCSC    2
DIFF    2
Name: count, dtype: int64